defmodule TaskTest do
  use ExUnit.Case
  doctest PoemBot
  alias Mix.Tasks.ImportUkrDb

  describe "ImportUkrDb" do
    test "replaces ***" do
      poem = "ЗАГУЛ ДМИТРО\n«Розіслалась далека дорога…» \n\n\n* * *\n\nРозіслалась далека дорога\nВ непривітну чужину мені…\nПрощавай, моя хатко убога!\nПрощавайте, достатки мої!\n\nЯ не знаю, коли ще побачу,\nЯк сьогодні покину я вас.\nТа дрібними сльозами заплачу\nНа чужині за вами не раз."

      parsed_poem = ImportUkrDb.parse_poem(poem)
      assert parsed_poem == %{
        author_name: "Загул Дмитро",
        poem: "Розіслалась далека дорога\nВ непривітну чужину мені…\nПрощавай, моя хатко убога!\nПрощавайте, достатки мої!\n\nЯ не знаю, коли ще побачу,\nЯк сьогодні покину я вас.\nТа дрібними сльозами заплачу\nНа чужині за вами не раз.",
        title: nil
      }
    end

    test "replaces redundant new lines" do
      poem = "ГЛІБОВ ЛЕОНІД\nДекому на догад \n\n\n\n\n\nТаку брехеньку мелють нам:\nЕ всюди щастя — тут і там,\nТа де шукати — не вгадаю;\nЯ і на ярмарку питав —\nНіхто по правді не сказав,\nА бог послав — тепер я знаю."

      parsed_poem = ImportUkrDb.parse_poem(poem)
      assert parsed_poem == %{
        author_name: "Глібов Леонід",
        poem: "Таку брехеньку мелють нам:\nЕ всюди щастя — тут і там,\nТа де шукати — не вгадаю;\nЯ і на ярмарку питав —\nНіхто по правді не сказав,\nА бог послав — тепер я знаю.",
        title: "Декому на догад "
      }
    end

    test "removes faux titles" do
      poem = "КАЛИНЕЦЬ ІГОР\n«довший час…» \n\n\n* * *\n\nдовший час\nя не показувався їй на вічі\n\nзахований за віями\nяк за густим частоколом\n\nвсі десять її пісеньок\nнавчився не мавши слуху\n\nколи вона тулила крило\nдо грудей\nя хотів бути крилом\n\nодного вечора\nнавіть зазирнув у шпарку\nяк вона роздягалася"
      parsed_poem = ImportUkrDb.parse_poem(poem)
      assert parsed_poem == %{
        author_name: "Калинець Ігор",
        poem: "довший час\nя не показувався їй на вічі\n\nзахований за віями\nяк за густим частоколом\n\nвсі десять її пісеньок\nнавчився не мавши слуху\n\nколи вона тулила крило\nдо грудей\nя хотів бути крилом\n\nодного вечора\nнавіть зазирнув у шпарку\nяк вона роздягалася",
        title: nil
      }
    end

    test "removes faux titles, but parses out year" do
      poem = "ВІНГРАНОВСЬКИЙ МИКОЛА\n«Поблимало впівщастя — й будь здоров…» (1975)\n\n\n* * *\n\nПоблимало впівщастя — й будь здоров!\nПісочок хитрий: наче він з невчора…\nПосушу сірники в твоїм волоссі.\n\n1975"
      parsed_poem = ImportUkrDb.parse_poem(poem)
      assert parsed_poem == %{
        author_name: "Вінграновський Микола",
        poem: "Поблимало впівщастя — й будь здоров!\nПісочок хитрий: наче він з невчора…\nПосушу сірники в твоїм волоссі.",
        title: nil,
        date: "1975",
        year: "1975"
      }
    end

    test "trims very long" do
      poem = "БЕЛЬСЬКИЙ СИДІР\nЗакарпатській Україні \n\n\nТо не пісня по долині, —\nСлізно плаче Верховина,\nТо не гули вод, —\nСтогне раб-народ.\n\nРиє землю джаганами*,\nТа посів його дощами\nГеть змива з узгір,\nАбо нищить звір.\n\nБезземелля чорні кручі…\nА лани взяли родючі\nПоміщик-упир,\nДука, монастир.\n\nСині гори Верховини,\nЛіс пахучий, полонини,\nРічки водограй —\nНіби справді рай.\n\nАле в цьому гаї-раї\nЛюд замучений конає,\nЗ голоду вмира\nПухла дітвора.\n\nТільки й їжи — бараболя…\nНад селом жандармська воля:\nВдів та хатній бруд\nСудить панський суд.\n\nГей, нуждарі-верховинці!\nВаші злидні поодинці\nСкидаймо в одно\nСпільнеє горно!\n\nТа самі собі поможем,\nЗлу неволю переможем.\nКуймо крицю-жар,\nЗгине пан, жандар!\n\nПрийде воля в Закарпаття.\nКрізь рожевоє багаття\nСонечко зася.\nГей, єднаймося!\n\n_____________________________________________________\n* Примітка: Джаган — знаряддя, яким копають землю для посіву."
      parsed_poem = ImportUkrDb.parse_poem(poem)
      assert parsed_poem == %{
        author_name: "Бельський Сидір",
        poem: "То не пісня по долині, —\nСлізно плаче Верховина,\nТо не гули вод, —\nСтогне раб-народ.\n\nРиє землю джаганами*,\nТа посів його дощами\nГеть змива з узгір,\nАбо нищить звір.\n\nБезземелля чорні кручі…\nА лани взяли родючі\nПоміщик-упир,\nДука, монастир.\n\nСині гори Верховини,\nЛіс пахучий, полонини,\nРічки водограй —\nНіби справді рай.\n\nАле в цьому гаї-раї\nЛюд замучений конає,\nЗ голоду вмира\nПухла дітвора.\n\nТільки й їжи — бараболя…\nНад селом жандармська воля:\nВдів та хатній бруд\nСудить панський суд.\n\nГей, нуждарі-верховинці!\nВаші злидні поодинці\nСкидаймо в одно\nСпільнеє горно!\n\nТа самі собі поможем,\nЗлу неволю переможем.\nКуймо крицю-жар,\nЗгине пан, жандар!\n\nПрийде воля в Закарпаття.\nКрізь рожевоє багаття\nСонечко зася.\nГей, єднаймося!\n\n__________\n* Примітка: Джаган — знаряддя, яким копають землю для посіву.",
        title: "Закарпатській Україні "
      }
    end

    test "parses long dates" do
      poem = "АНТОНИЧ БОГДАН-ІГОР\nДім за зорею (1936)\n\n\nСтрумує гімн рослин, що кличуть про нестримність зросту,\nі серцю, мов по сьомій чарці, невисловно п’янко.\nВід’їду вже. Тут був я тільки принагідним гостем.\nДо інших зір молитимусь і інших ждати ранків.\n\nНабрезклі пуп’янки бубнявіють в клеїстій піні,\nяк зорі до рослин, зустрівшись в поцілунку, липнуть,\nі крізь лійки фіялок ніч фільтрує чар весінній,\nаж пригорщами пахощів у чаші квіття сипне.\n\nЗелена ніч рослин душна екстазою знемоги,\nу скорчах розкоші кущі, коріння й пальці й листя\nнасіння вибухає, й місяць коле землю рогом,\nаж згасне днем закритий, що, мов змій, за ним іскриться.\n\nКоріння в черепах мерців сукате й соковите,\nжиття встромляє свердли гудзуваті в кубла смерті,\nі дуб прискакує до дуба — два боги сердиті,\nударивши з розгоном в пні, сплітаються уперті.\n\nВирують кола світляні — невломні мотовила,\nось благовіщення світанку — й сонце ніч розмеле.\nПий сьому чарку радощів! Хай серцю хміль і крила!\nПоезії кипучої і мудрої, мов зелень!\n\nЖиву коротку мить. Чи довше житиму, не знаю,\nтож вчусь в рослин сп’яніння, зросту і буяння соків.\nМабуть, мій дім не тут.\n                        Мабуть, аж за зорею.\n                                    Поки\nя тут, інстинктом чую це: співаю — тож існую.\n\nПід шкаралущею землі булькочуть рвійні води,\nкрайнебо в млах фіялкових за ранком, мов за муром.\nВід’їду вже з долонями на лірі сонця сходу,\nспіваючи хвалу надлюдським і рослинним бурям.\n\n7 березня 1936"
      parsed_poem = ImportUkrDb.parse_poem(poem)
      assert parsed_poem == %{
        author_name: "Антонич Богдан-Ігор",
        poem: "Струмує гімн рослин, що кличуть про нестримність зросту,\nі серцю, мов по сьомій чарці, невисловно п’янко.\nВід’їду вже. Тут був я тільки принагідним гостем.\nДо інших зір молитимусь і інших ждати ранків.\n\nНабрезклі пуп’янки бубнявіють в клеїстій піні,\nяк зорі до рослин, зустрівшись в поцілунку, липнуть,\nі крізь лійки фіялок ніч фільтрує чар весінній,\nаж пригорщами пахощів у чаші квіття сипне.\n\nЗелена ніч рослин душна екстазою знемоги,\nу скорчах розкоші кущі, коріння й пальці й листя\nнасіння вибухає, й місяць коле землю рогом,\nаж згасне днем закритий, що, мов змій, за ним іскриться.\n\nКоріння в черепах мерців сукате й соковите,\nжиття встромляє свердли гудзуваті в кубла смерті,\nі дуб прискакує до дуба — два боги сердиті,\nударивши з розгоном в пні, сплітаються уперті.\n\nВирують кола світляні — невломні мотовила,\nось благовіщення світанку — й сонце ніч розмеле.\nПий сьому чарку радощів! Хай серцю хміль і крила!\nПоезії кипучої і мудрої, мов зелень!\n\nЖиву коротку мить. Чи довше житиму, не знаю,\nтож вчусь в рослин сп’яніння, зросту і буяння соків.\nМабуть, мій дім не тут.\n                        Мабуть, аж за зорею.\n                                    Поки\nя тут, інстинктом чую це: співаю — тож існую.\n\nПід шкаралущею землі булькочуть рвійні води,\nкрайнебо в млах фіялкових за ранком, мов за муром.\nВід’їду вже з долонями на лірі сонця сходу,\nспіваючи хвалу надлюдським і рослинним бурям.",
        title: "Дім за зорею",
        date: "7 березня 1936",
        year: "1936"
      }
    end
  end
end